Repository: abdallah-mahmoud/Aldeewan
Catalog: lib/l10n/app_*.arb
Languages: ar

# appName
source: Aldeewan
ar: الديوان

# appTitle
source: Aldeewan
ar: الديوان

# appSlogan
source: Secure Financial Management
ar: إدارة مالية آمنة

source: Home
ar: الرئيسية

source: Ledger
ar: الدفتر

source: Cashbook
ar: الصندوق

source: Reports
ar: التقارير

source: Settings
ar: الإعدادات

source: Coming Soon
ar: قريباً

source: General
ar: عام

source: Dashboard
ar: لوحة التحكم

source: Recent Transactions
ar: المعاملات الأخيرة

source: Add Transaction
ar: إضافة معاملة

source: Add Person
ar: إضافة شخص

source: Search...
ar: بحث...

# noResults
source: No results found
ar: لا توجد نتائج

# addPersonPrompt
source: You need to add a person before adding a transaction
ar: تحتاج إلى إضافة شخص قبل إضافة معاملة

source: Appearance
ar: المظهر

source: Theme
ar: السمة

source: System
ar: النظام

source: Light
ar: فاتح

source: Dark
ar: داكن

source: Language
ar: اللغة

source: Data Management
ar: إدارة البيانات

# backupData
source: Backup Data (JSON)
ar: نسخ احتياطي (JSON)

# backupDataSubtitle
source: Export all data to a JSON file
ar: تصدير جميع البيانات إلى ملف JSON

# restoreData
source: Restore Data (JSON)
ar: استعادة البيانات (JSON)

# restoreDataSubtitle
source: Import data from a JSON file (Replaces current data)
ar: استيراد البيانات من ملف JSON (يستبدل البيانات الحالية)

# exportPersons
source: Export Persons (CSV)
ar: تصدير الأشخاص (CSV)

# exportTransactions
source: Export Transactions (CSV)
ar: تصدير المعاملات (CSV)

source: Person Statement
ar: كشف حساب

source: Cash Flow
ar: التدفق النقدي

source: About Developer
ar: عن المطور

# madeWithLove
source: Made with ❤️ by Motaasl
ar: صنع بـ ❤️ بواسطة متآصل

# appVersionInfo
source: Aldeewan Mobile v{version}
ar: الديوان موبايل إصدار {version}

source: Currency
ar: العملة

source: Currency Options
ar: خيارات العملة

# backupSuccess
source: Backup created successfully
ar: تم إنشاء النسخة الاحتياطية بنجاح

# backupFailed
source: Backup failed: {error}
ar: فشل النسخ الاحتياطي: {error}

# restoreSuccess
source: Data restored successfully
ar: تم استعادة البيانات بنجاح

# restoreFailed
source: Restore failed: {error}
ar: فشل الاستعادة: {error}

# exportSuccess
source: Export successful
ar: تم التصدير بنجاح

# exportFailed
source: Export failed: {error}
ar: فشل التصدير: {error}

source: Select Currency
ar: اختر العملة

# developerName
source: @motaasl8
ar: متآصل

source: Version
ar: الإصدار

source: Cancel
ar: إلغاء

source: Save
ar: حفظ

source: Delete
ar: حذف

source: Edit
ar: تعديل

source: Name
ar: الاسم

source: Phone
ar: رقم الهاتف

source: Role
ar: الدور

source: Amount
ar: المبلغ

source: Date
ar: التاريخ

source: Note
ar: ملاحظة

source: Category
ar: التصنيف

source: Type
ar: النوع

source: Income
ar: دخل

source: Expense
ar: صرف

source: Select Person
ar: اختر الشخص

source: No persons found
ar: لا يوجد أشخاص

source: Customer
ar: عميل

source: Supplier
ar: مورد

source: Unknown
ar: غير معروف

source: Date Range
ar: الفترة الزمنية

source: Select Date Range
ar: اختر الفترة

source: Generate Report
ar: إنشاء التقرير

# statementFor
source: Statement for {name}
ar: كشف حساب {name}

# period
source: Period: {start} - {end}
ar: الفترة: {start} - {end}

source: Balance Brought Forward
ar: الرصيد المرحل

source: Closing Balance
ar: الرصيد الختامي

source: Export CSV
ar: تصدير CSV

source: Debt
ar: دين (لنا)

source: Payment
ar: دفعة

source: Credit
ar: دين (علينا)

source: Transaction
ar: معاملة

source: Total Income
ar: إجمالي الدخل

source: Total Expense
ar: إجمالي المصروفات

source: Net Profit/Loss
ar: صافي الربح/الخسارة

source: Cash Flow Report
ar: تقرير التدفق النقدي

# developerTagline
source: Media | Photography | Editing | Design | Web | Software Dev "Professional, Quality and Art" #motaasl
ar: ميديا | تصوير | مونتاج | تصميم | ويب | تطوير برمجيات "احترافية وجودة وفن" #motaasl

# openSourceLink
source: View on GitHub
ar: عرض على GitHub

# islamicEndowment
source: This app is an Islamic charitable endowment (Waqf).
ar: هذا التطبيق وقف إسلامي خيري

source: Facebook
ar: فيسبوك

source: Instagram
ar: انستغرام

source: Email
ar: البريد الإلكتروني

# tagline
source: Your Personal Ledger & Cashbook
ar: دفتر حساباتك الشخصي

source: Quick Actions
ar: إجراءات سريعة

source: Add Debt
ar: إضافة دين

source: Record Payment
ar: تسجيل دفعة

# addCashEntry
source: Add Transaction
ar: إضافة معاملة

source: View Balances
ar: عرض الأرصدة

source: All Transactions
ar: كل المعاملات

source: Recent Activity
ar: أحدث المعاملات

source: No entries yet
ar: لا توجد معاملات حتى الآن

source: Total Receivable
ar: ديون لك

source: Total Payable
ar: ديون عليك

source: Transaction Details
ar: تفاصيل المعاملة

source: Delete Transaction
ar: حذف المعاملة

# deleteTransactionConfirm
source: Are you sure you want to delete this transaction?
ar: هل أنت متأكد من حذف هذه المعاملة؟

source: Deleted successfully
ar: تم الحذف بنجاح

source: Person
ar: الشخص

source: Saved successfully
ar: تم الحفظ بنجاح

# cashLabel
source: Cash
ar: نقد

# bankLabel
source: Bank
ar: بنك

source: Camera
ar: كاميرا

source: Gallery
ar: المعرض

# addToLedger
source: Add to Ledger (Debt/Credit)
ar: إضافة إلى الدفتر (دين/ائتمان)

# addToLedgerSubtitle
source: Requires selecting a person
ar: يتطلب اختيار شخص

# addToCashbook
source: Add to Cashbook (Income/Expense)
ar: إضافة إلى الصندوق (دخل/صرف)

# addToCashbookSubtitle
source: No person required
ar: لا يتطلب شخص

source: Scan Receipt
ar: مسح إيصال

# scanError
source: Error scanning receipt: {error}
ar: خطأ في مسح الإيصال: {error}

# scanTimeout
source: Scanning timed out
ar: انتهت مهلة المسح

source: Total Spent
ar: إجمالي المصروف

# goalReached
source: {percent}% Reached
ar: تم تحقيق {percent}%

# targetLabel
source: Target: {amount}
ar: الهدف: {amount}

source: Goal Progress
ar: تقدم الهدف

# budgetUsage
source: Budget Usage {percentage}
ar: استخدام الميزانية {percentage}

# pleaseEnterAmount
source: Please enter an amount
ar: الرجاء إدخال المبلغ

source: Invalid number
ar: رقم غير صحيح

# pleaseEnterName
source: Please enter a name
ar: الرجاء إدخال الاسم

source: Me
ar: أنا

source: Net Position
ar: صافي المركز المالي

source: Customers owe you more
ar: العملاء مدينون لك بأكثر

source: You owe suppliers more
ar: أنت مدين للموردين بأكثر

source: Profit this month
ar: ربح هذا الشهر

source: Loss this month
ar: خسارة هذا الشهر

source: All
ar: الكل

source: This Month
ar: هذا الشهر

source: Today
ar: اليوم

source: This Week
ar: هذا الأسبوع

source: Custom
ar: مخصص

# saleOnCredit
source: Sale (Credit)
ar: بيع (آجل)

source: Payment Received
ar: استلام دفعة

# purchaseOnCredit
source: Purchase (Credit)
ar: شراء (آجل)

source: Payment Made
ar: دفع دفعة

# debtGiven
source: Debt (Owed by)
ar: إقراض (دفعت له)

# debtTaken
source: Debt (Owed to)
ar: اقتراض (استلمت منه)

source: Cash Sale
ar: بيع (نقد)

# cashIncome
source: Extra Income
ar: إيراد إضافي

# cashExpense
source: Expenses
ar: مصروفات

source: Current Balance
ar: الرصيد الحالي

source: Settled
ar: خالص

source: Receivable
ar: ديون لك

source: Payable
ar: ديون عليك

source: Advance
ar: رصيد مقدم

source: Analytics
ar: التحليلات

source: Budgets
ar: الميزانيات

source: Goals
ar: الأهداف

source: Link Account
ar: ربط حساب

source: My Accounts
ar: حساباتي

source: Sync Accounts
ar: مزامنة الحسابات

source: Expenses by Category
ar: المصروفات حسب الفئة

source: Budget Summary
ar: ملخص الميزانية

source: Create Budget
ar: إنشاء ميزانية

source: Create Goal
ar: إنشاء هدف

source: Goal Name
ar: اسم الهدف

source: Monthly Limit
ar: الحد الشهري

source: Target Amount
ar: المبلغ المستهدف

source: Current Saved
ar: المدخرات الحالية

source: Add to Goal
ar: إضافة للهدف

source: Connect Bank
ar: ربط البنك

source: Select Provider
ar: اختر المزود

source: No expenses to show
ar: لا توجد مصروفات لعرضها

source: Unlock
ar: فتح القفل

source: App Locked
ar: التطبيق مقفل

source: Link
ar: ربط

# linkBankAccount
source: Link your bank account
ar: ربط حسابك البنكي

source: Error loading accounts
ar: خطأ في تحميل الحسابات

source: Person Not Found
ar: الشخص غير موجود

source: App Lock
ar: قفل التطبيق

# appLockSubtitle
source: Require authentication to open app
ar: طلب المصادقة لفتح التطبيق

source: Unlock App
ar: فتح التطبيق

# accountLinkedSuccess
source: Account linked successfully!
ar: تم ربط الحساب بنجاح!

# authFailed
source: Authentication failed. Please check credentials.
ar: فشلت المصادقة. يرجى التحقق من البيانات.

# linkBankAccountTitle
source: Link Bank Account
ar: ربط حساب بنكي

source: Connect Account
ar: اتصال بالحساب

# errorOccurred
source: Error: {error}
ar: خطأ: {error}

source: Simple Mode
ar: الوضع البسيط

# simpleModeSubtitle
source: Use simplified terminology (Lent/Borrowed)
ar: استخدام مصطلحات مبسطة (سلف/دين)

# simpleLent
source: Lent
ar: سلفته (لنا)

# simpleBorrowed
source: Borrowed
ar: تسلف منه (علينا)

# simpleGotPaid
source: Got Paid
ar: استلمت منه

# simplePaidBack
source: Paid Back
ar: سددت له

# currencyQAR
source: QAR (ر.ق)
ar: ريال قطري (ر.ق)

# currencySAR
source: SAR (ر.س)
ar: ريال سعودي (ر.س)

# currencyEGP
source: EGP (ج.م)
ar: جنيه مصري (ج.م)

# currencySDG
source: Sudanese Pound (SDG)
ar: جنيه سوداني (ج.س)

# currencyKWD
source: Kuwaiti Dinar (KWD)
ar: دينار كويتي (KWD)

source: Loading
ar: جاري التحميل

source: Error
ar: خطأ

# deleteCategoryTitle
source: Delete Category?
ar: حذف الفئة؟

# deleteCategoryContent
source: Are you sure you want to delete "{categoryName}"?
ar: هل أنت متأكد أنك تريد حذف "{categoryName}"؟

# newCategoryTitle
source: New Category
ar: فئة جديدة

# categoryType
source: Type:
ar: النوع:

source: Select Color
ar: اختر لوناً

source: Select Icon
ar: اختر أيقونة

source: Create
ar: إنشاء

source: Active
ar: نشط

source: History
ar: السجل

source: Over Budget
ar: تجاوز الميزانية

source: Remaining
ar: المتبقي

source: Spent
ar: المصروف

source: Limit
ar: الحد

# catHousing
source: Housing
ar: السكن

# catFood
source: Food & Dining
ar: الطعام

# catTransportation
source: Transportation
ar: المواصلات

# catHealth
source: Health
ar: الصحة

# catEntertainment
source: Entertainment
ar: الترفيه

# catShopping
source: Shopping
ar: التسوق

# catUtilities
source: Utilities
ar: الفواتير

# catIncome
source: Income
ar: الدخل

# catOther
source: Other
ar: أخرى

# catSavings
source: Savings
ar: المدخرات

source: Manage Categories
ar: إدارة الفئات

# budgetExceededMessage
source: You have exceeded your budget by {currency} {amount}
ar: لقد تجاوزت ميزانيتك بمقدار {currency} {amount}

# budgetRemainingMessage
source: You have {currency} {amount} remaining
ar: لديك {currency} {amount} متبقية

source: Delete Budget
ar: حذف الميزانية

# deleteBudgetConfirmation
source: Are you sure you want to delete this budget?
ar: هل أنت متأكد أنك تريد حذف هذه الميزانية؟

source: Delete Goal
ar: حذف الهدف

# deleteGoalConfirmation
source: Are you sure you want to delete this goal?
ar: هل أنت متأكد أنك تريد حذف هذا الهدف؟

source: Goal Details
ar: تفاصيل الهدف

source: Budget Details
ar: تفاصيل الميزانية

source: Deadline
ar: الموعد النهائي

source: Saved
ar: المدخرات

source: Target
ar: الهدف

source: Actions
ar: الإجراءات

source: Add Funds
ar: إضافة أموال

source: Withdraw
ar: سحب

source: Goal not found
ar: الهدف غير موجود

source: Budget not found
ar: الميزانية غير موجودة

# goalExceededError
source: Cannot add funds. Total saved would exceed the target amount.
ar: لا يمكن إضافة الأموال. إجمالي المدخرات سيتجاوز المبلغ المستهدف.

# budgetExceededError
source: Cannot add expense. Total spent would exceed the budget limit.
ar: لا يمكن إضافة المصروف. إجمالي المصروفات سيتجاوز حد الميزانية.

# goalExceededErrorWithRemaining
source: Cannot add funds. You can only add up to {amount}.
ar: لا يمكن إضافة الأموال. يمكنك إضافة ما يصل إلى {amount} فقط.

# budgetExceededErrorWithRemaining
source: Cannot add expense. You only have {amount} remaining in this budget.
ar: لا يمكن إضافة المصروف. لديك {amount} فقط متبقية في هذه الميزانية.

source: Expense Breakdown
ar: تفاصيل المصروفات

source: Edit Goal
ar: تعديل الهدف

source: Start Date
ar: تاريخ البدء

source: End Date
ar: تاريخ الانتهاء

source: No Date
ar: لا يوجد تاريخ

source: Edit Budget
ar: تعديل الميزانية

source: App Sounds
ar: أصوات التطبيق

# appSoundsSubtitle
source: Enable sound effects
ar: تشغيل أصوات عند الحفظ أو التنقل

source: Notifications
ar: الإشعارات

source: Mark all as read
ar: تحديد الكل كمقروء

# noNotifications
source: No notifications yet
ar: لا توجد إشعارات

source: Daily Reminder
ar: تذكير يومي

# dailyReminderSubtitle
source: Get a daily reminder to record your transactions
ar: احصل على تذكير يومي لتسجيل معاملاتك

# authenticateReason
source: Please authenticate to access Aldeewan
ar: يرجى المصادقة للوصول إلى الديوان

# dailyReminderTitle
source: Daily Reminder
ar: تذكير يومي

# dailyReminderBody
source: Don't forget to record your transactions for today!
ar: لا تنس تسجيل معاملاتك اليوم!

source: Reminder Time
ar: وقت التذكير

# budgetExceededTitle
source: Budget Exceeded
ar: تجاوزت الميزانية

# budgetExceededBody
source: You have exceeded your budget for {category} by {amount} {currency}.
ar: تجاوز {name} بمبلغ {amount} {currency}

# goalReachedTitle
source: Goal Reached!
ar: تم تحقيق الهدف! 🎉

# goalReachedBody
source: Congratulations! You have reached your goal: {goalName}.
ar: حققت هدفك: {name}

# insufficientFundsTitle
source: Insufficient Funds
ar: رصيد غير كافٍ

# insufficientFundsMessage
source: Your current balance ({balance} {currency}) is not enough for this expense of {amount} {currency}. Please add more funds first.
ar: رصيدك الحالي ({balance} {currency}) غير كافٍ لهذا المصروف بقيمة {amount} {currency}. يرجى إضافة المزيد من الأموال أولاً.

# tourWelcome
source: Welcome to Aldeewan!
ar: مرحباً بك في الديوان!

# tourDashboard
source: See your money at a glance
ar: هنا تشوف كل فلوسك

# tourAddTransaction
source: Tap here to add money in or out
ar: اضغط هنا تضيف فلوس داخلة أو خارجة

# tourLedger
source: People who owe you or you owe them
ar: الناس اللي لك أو عليك عندهم فلوس

# tourCashbook
source: Filter by income or expenses
ar: فلتر حسب الداخل أو الخارج

# tourSearch
source: Search by name, amount, or type
ar: دور بالاسم أو المبلغ أو النوع

# tourHelp
source: Need help? Come here anytime
ar: محتاج مساعدة؟ تعال هنا

# tourSkip
source: Skip
ar: تخطي

# tourNext
source: Next
ar: التالي

# tourFinish
source: Get Started
ar: ابدأ

# tourPrevious
source: Previous
ar: السابق

# tipQuickActions
source: Use Quick Actions for faster entry
ar: أزرار سريعة تسهل عليك

# tipFilterTransactions
source: Filter and search transactions by date, type, or name
ar: فلتر الحركات حسب التاريخ أو النوع أو الاسم

# tipPersonBalance
source: Tap a person to see their account
ar: اضغط على الشخص تشوف حسابه

# tipBudgetAlert
source: We'll tell you if you spend too much
ar: سنذكرك عند اقتراب ميزانيتك

# tipGoalProgress
source: Track your savings here
ar: تابع توفيرك هنا

# tipExportReport
source: Save reports as files
ar: احفظ التقارير كملفات

# tipGotIt
source: Got it
ar: فهمت

source: Help Center
ar: مركز المساعدة

# helpCenterSubtitle
source: FAQs and tutorials
ar: أسئلة شائعة ودروس

# restartTour
source: Restart Tutorial
ar: إعادة الشرح

# restartTourSubtitle
source: See the app guide again
ar: شوف دليل التطبيق مرة تانية

source: Contact Support
ar: تواصل معنا

# contactSupportSubtitle
source: Need help? Reach out to us
ar: محتاج مساعدة؟ كلمنا

# faqGettingStarted
source: Getting Started
ar: البداية

# faqWhatIsAldeewan
source: What is Aldeewan?
ar: ماهو الديوان؟

# faqWhatIsAldeewaAnswer
source: Aldeewan is a smart accounting app to manage your money, track debts, and set budgets.
ar: الديوان تطبيق حسابات ذكي يساعدك تدير فلوسك وتتابع الديون وتحدد ميزانيتك.

# faqHowToAddTransaction
source: How to add a transaction?
ar: كيف أضيف فلوس داخلة أو خارجة؟

# faqHowToAddTransactionAnswer
source: Tap the + button on any screen to add income or expense.
ar: اضغط على زر + في أي شاشة عشان تضيف دخل أو مصروف.

# faqCashbook
source: Cashbook
ar: دفتر النقدية (الدخل/المصروف)

# faqLedger
source: Ledger
ar: الديون (الأشخاص)

# faqBudgetsGoals
source: Budgets & Goals
ar: الميزانيات والأهداف

# faqReports
source: Reports
ar: التحليلات والتقارير

# faqSettings
source: Settings
ar: الإعدادات والبيانات

# initialBalanceTitle
source: Set Your Starting Balance
ar: أدخل رصيدك الحالي

# initialBalanceDescription
source: Enter the money you currently have to start tracking accurately.
ar: أدخل المبلغ الموجود لديك الآن لبدء التتبع بدقة.

source: Cash on Hand
ar: النقد المتاح

source: Bank Balance
ar: الرصيد البنكي

source: Skip for now
ar: تخطي الآن

source: Let's Go!
ar: هيا نبدأ!

# initialBalanceNote
source: Opening Balance
ar: الرصيد الافتتاحي

source: Backup to Cloud
ar: نسخ احتياطي للسحابة

# backupToCloudSubtitle
source: Save to Google Drive, Dropbox, OneDrive, etc.
ar: حفظ في جوجل درايف، دروبوكس، وان درايف، إلخ

# restoreFromCloud
source: Restore from Backup
ar: استعادة من النسخة الاحتياطية

# restoreFromCloudSubtitle
source: Import data from a backup file
ar: استيراد البيانات من ملف النسخة الاحتياطية

# restoreHelpTitle
source: How to Restore from Cloud
ar: كيفية الاستعادة من السحابة

# restoreHelpStep1
source: 1. Open your cloud app (Google Drive, Dropbox, etc.)
ar: ١. افتح تطبيق السحابة (جوجل درايف، دروبوكس، إلخ)

# restoreHelpStep2
source: 2. Find your Aldeewan backup file
ar: ٢. ابحث عن ملف النسخة الاحتياطية للديوان

# restoreHelpStep3
source: 3. Download it to your device
ar: ٣. حمّله على جهازك

# restoreHelpStep4
source: 4. Return here and tap 'Restore from Backup'
ar: ٤. ارجع هنا واضغط 'استعادة من النسخة الاحتياطية'

# restoreHelpStep5
source: 5. Select the downloaded file
ar: ٥. اختر الملف المُحمَّل

# faqDataBackup
source: Data & Backup
ar: البيانات والنسخ الاحتياطي

# faqHowToBackup
source: How do I backup my data?
ar: كيف أنسخ بياناتي احتياطياً؟

# faqHowToBackupAnswer
source: Go to Settings > Backup to Cloud. Your data will be saved as a JSON file that you can store in Google Drive, Dropbox, or any cloud app.
ar: اذهب إلى الإعدادات > نسخ احتياطي للسحابة. سيتم حفظ بياناتك كملف JSON يمكنك تخزينه في جوجل درايف أو دروبوكس أو أي تطبيق سحابي.

# faqHowToRestore
source: How do I restore from a backup?
ar: كيف أستعيد من النسخة الاحتياطية؟

# faqHowToRestoreAnswer
source: 1. Download your backup file from cloud storage to your device. 2. Go to Settings > Restore from Backup. 3. Select the downloaded JSON file.
ar: ١. حمّل ملف النسخة الاحتياطية من السحابة إلى جهازك. ٢. اذهب إلى الإعدادات > استعادة من النسخة الاحتياطية. ٣. اختر ملف JSON المُحمَّل.

# faqWhereIsData
source: Where is my data stored?
ar: أين يتم تخزين بياناتي؟

# faqWhereIsDataAnswer
source: Your data is stored locally on your device in an encrypted database. It never leaves your device unless you choose to backup to cloud.
ar: يتم تخزين بياناتك محلياً على جهازك في قاعدة بيانات مشفرة. لا تغادر بياناتك جهازك أبداً إلا إذا اخترت النسخ الاحتياطي للسحابة.
